/*
    Суть, сделать бэк в котором будет авторизация и сощдание постов
    1) Юзеры
        Регитсрация
        Авторизация
        Исправление Логина Пороля
    2) посты
        Все посты
        Новый Пост
        Редактировать Пост
        Получить Пост По айди
        Удалить Пост
     Модели
        Юзер -
            Айди
            Логин
            Пороль
        Пост
            Айди
            Название
            Текст
    Примечание
        -Выучить jwt авторизацию(Видео есть у ulbiTv)
        -Сделать правильную архитектуру
        -Правильно настроить конфиг
        -Использовать env для настройки БД и Порта
        -сделать dev и prod команды для npm ( npm run dev ) ( npm run prod )
    Дедлайн
        До завтра
    Желаемая Структура
        Корень:
            app.js
            .env
            controller
            dto
            service
            module
    Модули
        express bcrypt jsonwebtoken
*/

